---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport
source: html/542a82d1-f354-9c26-975c-4eb96fa69420.htm
---
# ViewSystemsAnalysisReport Methods

Adds a filter to the view.